# თქვენი სიტყვებით ახსენით რა არის ცვლადი, ცვლადის სახელი, ცვლადის მნიშვნელობა. ასევე ახსენით რაში გვადგება ცვლადები.

print("ცვლადები არის კონტეინერები მონაცემთა მნიშვნელობების შესანახად.")

print("ჩვენ ვისწავლეთ 3 სახის ცვლადი ესენია: str(strin) ტიპის ცვლადი; int(integer) მთელი რიცხვის ცვლადი:")
print("float ტიპის ცვლადი (ათწილადი) და boolean (bool) ტიპის ცვლადი, ესენი არის ცვლადის სახელები.")
print("ცვლადის სახელი უნდა დაიწყოს ასოთი ან ქვედა ხაზით ცვლადის სახელი არ შეიძლება დაიწყოს ნომრით")

print("ცვლადი გვადგება იმაში რომ იგი იქმნება იმ მომენტში როდესაც თქვენ ანიჭებთ მას მნიშვნელობას.")
