// შექმენით ერთი ფუნქცია, სახელად travserseArr, რომელსაც ექნება ერთი პარამეტრი 
// (ამ პარამეტრში შეინახება მასივი). ფუნქციის კოდის ბლოკი ისე დაწერეთ, 
// რომ ციკლით გადაუაროთ მასივს და დაბეჭდოთ მისი ყველა ელემენტი.
// ფუნქცია გამოიძახეთ ორჯერ, არგუმენტად გაუწერეთ განსხვავებული მასივები 

function travserseArr(arr) {
    for (let i = 0; i < arr.lenght; i++) {
        console.log(arr[i])
    }
}

const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

const arr2 = ["string", true, 11, {key: "string"}, [1, 2]];

travserseArr(arr);
travserseArr(arr2);