# 1) პირველი დავალების ამოცანებიდან აირჩიეთ ნებისმიერი და დეტალურად გაარჩიეთ მისი კოდი კომენტარების სახით

def past(h, m, s):
    sum_of_seconds = 0
    
    # hour -> second
    sum_of_seconds += h * 3600
    
    # minute -> second
    sum_of_seconds += m * 60
    
    # second
    sum_of_seconds += s
    
    # result
    result = sum_of_seconds * 1000
    
    return result

# 1
# აქ არის ფუნქცია სახელწოდებით past, რომელიც იღებს სამ პარამეტრს:h-საათი, m-წუთი და s-წამი. ამ პარამეტრების დახმარებით ფუნქცია ითვლის რამდენი მილიწამი არის გავლის დრო.

# 2
# აქ გამოცხადდება ცვლადი sum_of_seconds, რომელიც ემსახურება დროის დაჯამებას წამებში. თავდაპირველად მას აქვს მნიშვნელობა 0.

# 3
# 