# 2) თქვენი სიტყვებით ახსენით რა არის ციკლი და იტერაცია

print(" იგი მოიცავს პრობლემის ფორმულირებას, დაგეგმვას, კოდირებას, ტესტირებას, გამართვას და შენარჩუნებას.")
print("  ამ მეთოდს შეუძლია დაეხმაროს პროგრამისტებს მაღალი ხარისხის პროგრამების წარმოებაში, რომლებიც მასშტაბური, საიმედო და ეფექტურია.")

print(" განცხადებების ან რაიმე სხვა სიმრავლის განმეორებით შესრულებას იტერაცია ეწოდება.")

# 4) შექმენით დიაპაზონი 20-დან 50-მდე და შეინახეთ ცვლადში

for i in range(20, 50):
    print("GOA")

# 5) შექმენით დიაპაზონი 100-დან 150-მდე და შეინახეთ ცვლადში   

for i in range(100, 150):
    print("GOA-ACADEMY")

# 6) შექმენით 20-დან 50-მდე ლუწი რიცხვების დიაპაზონი და შეინახეთ ცვლადში

for i in range(20, 50, 2):
    print(i*2)

# 7) შექმენით 11-დან 31-მდე კენტი რიცხვების დიაპაზონი და შეინახეთ ცვლადში

for i in range(11, 31, 2):
    print(i*3)

# 8) for ციკლით 10-ჯერ დაბეჭდეთ თქვენი სახელი და გვარი

for i in range(10):
    print("Luka Gorgadze")

# 9) 10-დან 30-მდე დაბეჭდეთ ყველა რიცხვი გაყოფილი 2-ზე

for num in range(10, 30):
    print(num/2)

# 10) 40-დან 60-მდე დაბეჭდეთ ყველა რიცხვის მესამე ხარისხი

for num1 in range(40, 60):
    print(num1**3)

# 11) 5-ჯერ შეეკითხეთ მომხმარებელს რიცხვი და ხუთივეჯერ დაბეჭდეთ. შეასრულეთ ციკლით, პირდაპირ დაწერილი არ ითვლება

for i in range(5):
    print(input("Enter the number: "))

# 12) მომხმარებელს შეეკითხეთ სახელი და მოახდინეთ მასზე იტერაცია for ციკლით, დაბეჭდეთ სახელის თითოეული ასო

name=input("Enter your name: ")
for letter in name:
    print(letter)

# 13) მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num1 ცვლადში მთელი რიცხვის სახით.
# მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num2 ცვლადში მთელი რიცხვის სახით.
# მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num3 ცვლადში მთელი რიცხვის სახით.

# შექმენით შემდეგი დიაპაზონი: range(num1, num2, num3)

# გადაუარეთ ამ დიაპაზონს for ციკლით და დაბეჭდეთ საიტერაციო ცვლადის კვადრატები

num1=int(input("Enter first number: "))
num2=int(input("Enter second number: "))
num3=int(input("Enter third number: "))

for num1 in range(num1, num2, num3):
    print(num1**2, num2**2, num3**2)

# 14) ციკლის გარეთ შექმენით ცვლადი სახელად sum და გაუტოლეთ 0-ს. ციკლით იტერაცია მოახდინეთ 5-დან 15-ის ჩათვლით
# და თითოეული საიტერაციო ცვლადი დაუმატეთ num ცვლადს. საბოლოოდ დაბეჭდეთ sum ცვლადის მნიშვნელობა.

sum=0
for num7 in range(7,17):
    sum +=num7
print(sum)

# 15) საბოლოოდ ახსენით რა დამღლელი იქნებოდა ციკლების მაგივრად ამ ყველაფრის ხელით წერა

print(" ეს ციკლები რომ არ ჩვენ თითოელი ბრძანების წერა მოგვიწევდა თითო თითოდ რომ ჩამოგვეწერა")
print(" ამ პრობლემის გადაჭრაში კი გვეხმარება for ციკლი რომლის საშვალებითაც უფრო მარტივად და ბევრი წვალების გარეშე ვწერთ.")