# 3) თქვენი სიტყვებით ახსენით განსხვავება while და for ციკლებს შორის

print("while ციკლი გამოიყენება მაშინ, როცა არ ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი (მაგალითად, სანამ პოვდება სწორი პირობა")
print("for ციკლი გამოიყენება მაშინ, როდესაც ჩვენ ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი (მაგალითად, როდესაც ვმუშაობთ სიებთან ან რიცხვებთან).")

print("while საშუალებას გვაძლევს, რომ გამოვიყენოთ ცვლადები პირობის შესამოწმებლად.")
print("for ციკლი უფრო კარგად მუშაობს იმ შემთხვევებში, როცა გვაქვს დადგენილი რიცხვი ან კოლექცია მაგ: სია და სხვა ამდაგვარი რამ.")