//  საკლასო დავალება:

// შექმენით ფუნქცია სახელად userLoop. ამ ფუნქციაში მომხმარებელს შემოატანინეთ
// ორი რიცხვი და შეინახეთ ისინი ცვლადებში, number მონაცემთა ტიპში.
// თქვენი დავალებაა, რომ პირველი რიცხვიდან მეორე რიცხვამდე ყველა
// რიცხვი დაბეჭდოთ კონსოლში. გამოიყენეთ ნებისმიერი ციკლი.
// ეს ფუნქცია გაუშვით მაშინ, როდესაც ვებსაიტი ჩაიტვირთება

function userLoop() {
    let num1 = Number(prompt("Enter first number: "))
    let num2 = Number(prompt("Enter second number:"))

    if (num1 <= num2) {
        for(let i = num1; i < num2; i++) {
            console.log(i);
        }
    }
}

userLoop()