# 1) თქვენი სიტყვებით ახსენით რა განსხვავებაა format ფუნქციასა და f სთრინგს შორის, ასევე რა განსხვავებაა append-სა და insert-ს შორის

# format ფუნქცია- ეს არის მეთოდი, რომელიც გამოიყენება სტრინგების ფორმატირებისათვის.
# f-სტრინგი უფრო კითხვისთვის კომფორტული და სწრაფია

# append: ეს მეთოდი გამოიყენება ელემენტის დასამატებლად სიაში ბოლოს.
# თუ გვაქვს ლისტი და ამოიყვანს append, ის ელემენტს ჩაამატებს სიის ბოლოს

# ეს მეთოდი საშუალებას აძლევს მომხმარებელს დაამატოს ელემენტი კონკრეტულ პოზიციაზე სიაში. 
# მას ორი არგუმენტი სჭირდება: პირველი - ინდექსი, მეორე - ელემენტი.